Revit 2027 API
ElectricalAnalyticalNode.GetAllDownstreamLoadIds Method
 Get all the descendant Electrical Analytical Load ids of the node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetAllDownstreamLoadIds()
Public Function GetAllDownstreamLoadIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetAllDownstreamLoadIds()
member GetAllDownstreamLoadIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
Remarks
 No matter the load is on stand by or not, the load id will be included in the returned load ids set.
See Also
Reference
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace